# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'tree' # List directories in a tree structure
brew 'wget'

# Development
brew 'asdf'
brew 'composer'
brew 'imagemagick'
brew 'php'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'blockblock'
cask 'charles'
cask 'coda'
cask 'daisydisk'
cask 'docker'
cask 'drawio'
cask 'dropbox'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'little-snitch'
cask 'phpstorm'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'viscosity'
cask 'vlc'
cask 'whatsapp'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-source-sans-pro'

# Mac App Store
mas 'Baby Monitor 3G', id: 626137367
mas 'Better', id: 1121192229
mas 'Blink Lite', id: 431473881
mas 'Fantastical', id: 975937182
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Spark', id: 1176895641
mas 'Tweetbot', id: 557168941
mas 'WeTransfer', id: 1114922065
